In [1]:
import pandas as pd

In [2]:
data={"country":["india","uk","austria","us","canada","pakistan"],
      "GDP":[123,123,678,2134,3456,232],
      "country_type":["developing","developed","developed","developed","developed","developing"]}  # from dictionary 
df=pd.DataFrame(data)
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [3]:
#making country as index to use it as string: set_index
df.set_index(df["country"],inplace=True)

In [4]:
df.index

Index(['india', 'uk', 'austria', 'us', 'canada', 'pakistan'], dtype='object', name='country')

In [8]:
df.drop(columns="country",inplace=True)

In [9]:
#df.iloc[:,"country_type"] #string data
df.loc[["uk","canada"]]

          GDP country_type
country
uk        123    developed
canada   3456    developed

In [10]:
df.reset_index(inplace=True)
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [11]:
d1 = {'Name':['Martha', 'Tim', 'Rob', 'Georgia'],
        'Maths':[87, 91, 97, 95],
        'Science':[83, 99, 84, 76]
       }
df1=pd.DataFrame(d1)
df1

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76

In [12]:
#to update a row at 2nd place using iloc(using col index)
df1.iloc[2]=["jiya",78,89]
df1 #rob's row removed (original)

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2     jiya     78       89
3  Georgia     95       76

In [13]:
#if only a particular col value in a row needs to be updated
df1["Name"].iloc[0]="viv"
df1

C:\Users\asus\AppData\Local\Temp\ipykernel_21080\15451926.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1["Name"].iloc[0]="viv"

      Name  Maths  Science
0      viv     87       83
1      Tim     91       99
2     jiya     78       89
3  Georgia     95       76

In [14]:
#row deletion
df1.drop(1,inplace=True)

In [15]:
df1

      Name  Maths  Science
0      viv     87       83
2     jiya     78       89
3  Georgia     95       76

In [16]:
#changing column name
#df.rename(columns={"old":"new"})
df=pd.DataFrame({"state":["delhi","gujrat","up","goa","mp","sikkim"],
                 "population":[90,80,70,10,34,30],"state_region":["north","west","north","south","south","east"]})
df.rename(columns={"state":"country_state"},inplace=True) #dict {old value:new value}
df

  country_state  population state_region
0         delhi          90        north
1        gujrat          80         west
2            up          70        north
3           goa          10        south
4            mp          34        south
5        sikkim          30         east

In [17]:
#column reordering
df=df[["population","country_state","state_region"]]
df

   population country_state state_region
0          90         delhi        north
1          80        gujrat         west
2          70            up        north
3          10           goa        south
4          34            mp        south
5          30        sikkim         east

In [19]:
#column addition: feature engineering (adding new feature from existing ones)
# 1col: series
l=[]
for i in df["population"]: #to fetch each value from col p
    l.append(i*i)
l
#make this list into series then add to data frame
s=pd.Series(l)
print(s)

print(type(s))

df["p_square"]=s #new series col name
df

0    8100
1    6400
2    4900
3     100
4    1156
5     900
dtype: int64
<class 'pandas.core.series.Series'>

C:\Users\asus\AppData\Local\Temp\ipykernel_21080\3466602875.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["p_square"]=s #new series col name

   population country_state state_region  p_square
0          90         delhi        north      8100
1          80        gujrat         west      6400
2          70            up        north      4900
3          10           goa        south       100
4          34            mp        south      1156
5          30        sikkim         east       900

In [20]:
#extracting the column names of particular type
#df.select_dtypes(include=" dtype ")
print(df.dtypes)
#object ones need to be found (object=string)
k=df.select_dtypes(include="object")
k

population        int64
country_state    object
state_region     object
p_square          int64
dtype: object

  country_state state_region
0         delhi        north
1        gujrat         west
2            up        north
3           goa        south
4            mp        south
5        sikkim         east

In [22]:
#changing type of a column
df["population"]=df["population"].astype("float")
df.dtypes

C:\Users\asus\AppData\Local\Temp\ipykernel_21080\1670545906.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["population"]=df["population"].astype("float")

population       float64
country_state     object
state_region      object
p_square           int64
dtype: object